# Главная страница доступна анонимному пользователю.
# Страницы списка заметок, отдельной заметки, удаления и редактирования заметки доступны автору.
# При попытке перейти на страницы списка заметок, отдельной заметки, редактирования или удаления заметки анонимный пользователь перенаправляется на страницу авторизации.
# Авторизованный пользователь не может зайти на страницы отдельной заметки, редактирования или удаления чужих комментариев (возвращается ошибка 404).
# Страницы регистрации пользователей, входа в учётную запись и выхода из неё доступны анонимным пользователям.
